<!-- add-pr-comment:add-pr-comment -->

Terraform Plan **production **:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
 <= read (data resources)

Terraform will perform the following actions:

  # module.crom_eks.aws_iam_role.eks_cluster_role will be created
+   resource "aws_iam_role" "eks_cluster_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "eks.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "eks-cluster-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.crom_eks.aws_iam_role.eks_node_group_role will be created
+   resource "aws_iam_role" "eks_node_group_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "eks-node-group-role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.crom_eks.aws_iam_role_policy_attachment.eks_cluster_AmazonEKSClusterPolicy will be created
+   resource "aws_iam_role_policy_attachment" "eks_cluster_AmazonEKSClusterPolicy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
+       role       = "eks-cluster-role"
    }

  # module.crom_eks.aws_iam_role_policy_attachment.eks_cluster_AmazonEKSVPCResourceController will be created
+   resource "aws_iam_role_policy_attachment" "eks_cluster_AmazonEKSVPCResourceController" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
+       role       = "eks-cluster-role"
    }

  # module.crom_eks.aws_iam_role_policy_attachment.eks_node_group_AmazonEC2ContainerRegistryReadOnly will be created
+   resource "aws_iam_role_policy_attachment" "eks_node_group_AmazonEC2ContainerRegistryReadOnly" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       role       = "eks-node-group-role"
    }

  # module.crom_eks.aws_iam_role_policy_attachment.eks_node_group_AmazonEKSWorkerNodePolicy will be created
+   resource "aws_iam_role_policy_attachment" "eks_node_group_AmazonEKSWorkerNodePolicy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
+       role       = "eks-node-group-role"
    }

  # module.crom_eks.aws_iam_role_policy_attachment.eks_node_group_AmazonEKS_CNI_Policy will be created
+   resource "aws_iam_role_policy_attachment" "eks_node_group_AmazonEKS_CNI_Policy" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
+       role       = "eks-node-group-role"
    }

  # module.crom_eks.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
+       certificates = (known after apply)
+       id           = (known after apply)
+       url          = (known after apply)
    }

  # module.crom_eks.module.eks.aws_cloudwatch_log_group.this[0] will be created
+   resource "aws_cloudwatch_log_group" "this" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/aws/eks/webapp-kube/cluster"
+       name_prefix       = (known after apply)
+       retention_in_days = 90
+       skip_destroy      = false
+       tags              = {
+           "Environment" = "Production"
+           "Name"        = "/aws/eks/webapp-kube/cluster"
+           "Project"     = "web-app-kube"
        }
+       tags_all          = {
+           "Environment" = "Production"
+           "Name"        = "/aws/eks/webapp-kube/cluster"
+           "Project"     = "web-app-kube"
        }
    }

  # module.crom_eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
+   resource "aws_ec2_tag" "cluster_primary_security_group" {
+       id          = (known after apply)
+       key         = "Environment"
+       resource_id = (known after apply)
+       value       = "Production"
    }

  # module.crom_eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Project"] will be created
+   resource "aws_ec2_tag" "cluster_primary_security_group" {
+       id          = (known after apply)
+       key         = "Project"
+       resource_id = (known after apply)
+       value       = "web-app-kube"
    }

  # module.crom_eks.module.eks.aws_eks_cluster.this[0] will be created
+   resource "aws_eks_cluster" "this" {
+       arn                       = (known after apply)
+       certificate_authority     = (known after apply)
+       cluster_id                = (known after apply)
+       created_at                = (known after apply)
+       enabled_cluster_log_types = [
+           "api",
+           "audit",
+           "authenticator",
        ]
+       endpoint                  = (known after apply)
+       id                        = (known after apply)
+       identity                  = (known after apply)
+       name                      = "webapp-kube"
+       platform_version          = (known after apply)
+       role_arn                  = (known after apply)
+       status                    = (known after apply)
+       tags                      = {
+           "Environment" = "Production"
+           "Project"     = "web-app-kube"
        }
+       tags_all                  = {
+           "Environment" = "Production"
+           "Project"     = "web-app-kube"
        }
+       version                   = "1.28"

+       encryption_config {
+           resources = [
+               "secrets",
            ]

+           provider {
+               key_arn = (known after apply)
            }
        }

+       kubernetes_network_config {
+           ip_family         = (known after apply)
+           service_ipv4_cidr = (known after apply)
+           service_ipv6_cidr = (known after apply)
        }

+       timeouts {}

+       vpc_config {
+           cluster_security_group_id = (known after apply)
+           endpoint_private_access   = true
+           endpoint_public_access    = true
+           public_access_cidrs       = [
+               "0.0.0.0/0",
            ]
+           security_group_ids        = (known after apply)
+           subnet_ids                = (known after apply)
+           vpc_id                    = (known after apply)
        }
    }

  # module.crom_eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
+   resource "aws_iam_openid_connect_provider" "oidc_provider" {
+       arn             = (known after apply)
+       client_id_list  = [
+           "sts.amazonaws.com",
        ]
+       id              = (known after apply)
+       tags            = {
+           "Environment" = "Production"
+           "Name"        = "webapp-kube-eks-irsa"
+           "Project"     = "web-app-kube"
        }
+       tags_all        = {
+           "Environment" = "Production"
+           "Name"        = "webapp-kube-eks-irsa"
+           "Project"     = "web-app-kube"
        }
+       thumbprint_list = (known after apply)
+       url             = (known after apply)
    }

  # module.crom_eks.module.eks.aws_iam_policy.cluster_encryption[0] will be created
+   resource "aws_iam_policy" "cluster_encryption" {
+       arn         = (known after apply)
+       description = "Cluster encryption policy to allow cluster role to utilize CMK provided"
+       id          = (known after apply)
+       name        = (known after apply)
+       name_prefix = "webapp-kube-cluster-ClusterEncryption"
+       path        = "/"
+       policy      = (known after apply)
+       policy_id   = (known after apply)
+       tags        = {
+           "Environment" = "Production"
+           "Project"     = "web-app-kube"
        }
+       tags_all    = {
+           "Environment" = "Production"
+           "Project"     = "web-app-kube"
        }
    }

  # module.crom_eks.module.eks.aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "eks.amazonaws.com"
                        }
+                       Sid       = "EKSClusterAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "webapp-kube-cluster-"
+       path                  = "/"
+       tags                  = {
+           "Environment" = "Production"
+           "Project"     = "web-app-kube"
        }
+       tags_all              = {
+           "Environment" = "Production"
+           "Project"     = "web-app-kube"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = "webapp-kube-cluster"
+           policy = jsonencode(
                {
+                   Statement = [
+                       {
+                           Action   = [
+                               "logs:CreateLogGroup",
                            ]
+                           Effect   = "Deny"
+                           Resource = "*"
                        },
                    ]
+                   Version   = "2012-10-17"
                }
            )
        }
    }

  # module.crom_eks.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
+   resource "aws_iam_role_policy_attachment" "cluster_encryption" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = (known after apply)
    }

  # module.crom_eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
+       role       = (known after apply)
    }

  # module.crom_eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
+       role       = (known after apply)
    }

  # module.crom_eks.module.eks.aws_security_group.cluster[0] will be created
+   resource "aws_security_group" "cluster" {
+       arn                    = (known after apply)
+       description            = "EKS cluster security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "webapp-kube-cluster-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment" = "Production"
+           "Name"        = "webapp-kube-cluster"
+           "Project"     = "web-app-kube"
        }
+       tags_all               = {
+           "Environment" = "Production"
+           "Name"        = "webapp-kube-cluster"
+           "Project"     = "web-app-kube"
        }
+       vpc_id                 = (known after apply)
    }

  # module.crom_eks.module.eks.aws_security_group.node[0] will be created
+   resource "aws_security_group" "node" {
+       arn                    = (known after apply)
+       description            = "EKS node shared security group"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "webapp-kube-node-"
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Environment"                       = "Production"
+           "Name"                              = "webapp-kube-node"
+           "Project"                           = "web-app-kube"
+           "kubernetes.io/cluster/webapp-kube" = "owned"
        }
+       tags_all               = {
+           "Environment"                       = "Production"
+           "Name"                              = "webapp-kube-node"
+           "Project"                           = "web-app-kube"
+           "kubernetes.io/cluster/webapp-kube" = "owned"
        }
+       vpc_id                 = (known after apply)
    }

  # module.crom_eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
+   resource "aws_security_group_rule" "cluster" {
+       description              = "Node groups to cluster API"
+       from_port                = 443
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["egress_all"] will be created
+   resource "aws_security_group_rule" "node" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Allow all egress"
+       from_port                = 0
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 0
+       type                     = "egress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node groups"
+       from_port                = 443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 4443/tcp webhook"
+       from_port                = 4443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 4443
+       type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 6443/tcp webhook"
+       from_port                = 6443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 6443
+       type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 8443/tcp webhook"
+       from_port                = 8443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 8443
+       type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node 9443/tcp webhook"
+       from_port                = 9443
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 9443
+       type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Cluster API to node kubelets"
+       from_port                = 10250
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 10250
+       type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node ingress on ephemeral ports"
+       from_port                = 1025
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 65535
+       type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
+   resource "aws_security_group_rule" "node" {
+       description              = "Node to node CoreDNS UDP"
+       from_port                = 53
+       id                       = (known after apply)
+       prefix_list_ids          = []
+       protocol                 = "udp"
+       security_group_id        = (known after apply)
+       security_group_rule_id   = (known after apply)
+       self                     = true
+       source_security_group_id = (known after apply)
+       to_port                  = 53
+       type                     = "ingress"
    }

  # module.crom_eks.module.eks.time_sleep.this[0] will be created
+   resource "time_sleep" "this" {
+       create_duration = "30s"
+       id              = (known after apply)
+       triggers        = {
+           "cluster_certificate_authority_data" = (known after apply)
+           "cluster_endpoint"                   = (known after apply)
+           "cluster_name"                       = "webapp-kube"
+           "cluster_version"                    = "1.28"
        }
    }

  # module.crom_eks.module.node_group_private.aws_eks_node_group.this[0] will be created
+   resource "aws_eks_node_group" "this" {
+       ami_type               = (known after apply)
+       arn                    = (known after apply)
+       capacity_type          = "ON_DEMAND"
+       cluster_name           = "webapp-kube"
+       disk_size              = (known after apply)
+       id                     = (known after apply)
+       instance_types         = [
+           "t3a.medium",
        ]
+       labels                 = {
+           "AccessSpecifier" = "private"
        }
+       node_group_name        = (known after apply)
+       node_group_name_prefix = "private-"
+       node_role_arn          = (known after apply)
+       release_version        = (known after apply)
+       resources              = (known after apply)
+       status                 = (known after apply)
+       subnet_ids             = (known after apply)
+       tags                   = {
+           "Name" = "private"
        }
+       tags_all               = {
+           "Name" = "private"
        }
+       version                = "1.28"

+       launch_template {
+           id      = (known after apply)
+           name    = (known after apply)
+           version = (known after apply)
        }

+       scaling_config {
+           desired_size = 2
+           max_size     = 3
+           min_size     = 1
        }

+       timeouts {}

+       update_config {
+           max_unavailable_percentage = 33
        }
    }

  # module.crom_eks.module.node_group_private.aws_iam_role.this[0] will be created
+   resource "aws_iam_role" "this" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "ec2.amazonaws.com"
                        }
+                       Sid       = "EKSNodeAssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "private-eks-node-group-"
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)
    }

  # module.crom_eks.module.node_group_private.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
+       role       = (known after apply)
    }

  # module.crom_eks.module.node_group_private.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
+       role       = (known after apply)
    }

  # module.crom_eks.module.node_group_private.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
+   resource "aws_iam_role_policy_attachment" "this" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
+       role       = (known after apply)
    }

  # module.crom_eks.module.node_group_private.aws_launch_template.this[0] will be created
+   resource "aws_launch_template" "this" {
+       arn                    = (known after apply)
+       default_version        = (known after apply)
+       id                     = (known after apply)
+       latest_version         = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = "private-eks-node-group-"
+       tags_all               = (known after apply)
+       update_default_version = true
+       vpc_security_group_ids = (known after apply)

+       metadata_options {
+           http_endpoint               = "enabled"
+           http_protocol_ipv6          = (known after apply)
+           http_put_response_hop_limit = 2
+           http_tokens                 = "required"
+           instance_metadata_tags      = (known after apply)
        }

+       monitoring {
+           enabled = true
        }

+       tag_specifications {
+           resource_type = "instance"
+           tags          = {
+               "Name" = "private"
            }
        }
+       tag_specifications {
+           resource_type = "network-interface"
+           tags          = {
+               "Name" = "private"
            }
        }
+       tag_specifications {
+           resource_type = "volume"
+           tags          = {
+               "Name" = "private"
            }
        }
    }

  # module.crom_vpc.module.vpc.aws_default_network_acl.this[0] will be created
+   resource "aws_default_network_acl" "this" {
+       arn                    = (known after apply)
+       default_network_acl_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       tags                   = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-default"
        }
+       tags_all               = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-default"
        }
+       vpc_id                 = (known after apply)

+       egress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
        }
+       egress {
+           action     = "allow"
+           cidr_block = "0.0.0.0/0"
+           from_port  = 0
+           protocol   = "-1"
+           rule_no    = 100
+           to_port    = 0
        }

+       ingress {
+           action          = "allow"
+           from_port       = 0
+           ipv6_cidr_block = "::/0"
+           protocol        = "-1"
+           rule_no         = 101
+           to_port         = 0
        }
+       ingress {
+           action     = "allow"
+           cidr_block = "0.0.0.0/0"
+           from_port  = 0
+           protocol   = "-1"
+           rule_no    = 100
+           to_port    = 0
        }
    }

  # module.crom_vpc.module.vpc.aws_default_route_table.default[0] will be created
+   resource "aws_default_route_table" "default" {
+       arn                    = (known after apply)
+       default_route_table_id = (known after apply)
+       id                     = (known after apply)
+       owner_id               = (known after apply)
+       route                  = (known after apply)
+       tags                   = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-default"
        }
+       tags_all               = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-default"
        }
+       vpc_id                 = (known after apply)

+       timeouts {
+           create = "5m"
+           update = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_default_security_group.this[0] will be created
+   resource "aws_default_security_group" "this" {
+       arn                    = (known after apply)
+       description            = (known after apply)
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = (known after apply)
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-default"
        }
+       tags_all               = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-default"
        }
+       vpc_id                 = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_eip.nat[0] will be created
+   resource "aws_eip" "nat" {
+       allocation_id        = (known after apply)
+       association_id       = (known after apply)
+       carrier_ip           = (known after apply)
+       customer_owned_ip    = (known after apply)
+       domain               = "vpc"
+       id                   = (known after apply)
+       instance             = (known after apply)
+       network_border_group = (known after apply)
+       network_interface    = (known after apply)
+       private_dns          = (known after apply)
+       private_ip           = (known after apply)
+       public_dns           = (known after apply)
+       public_ip            = (known after apply)
+       public_ipv4_pool     = (known after apply)
+       tags                 = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-us-east-1a"
        }
+       tags_all             = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-us-east-1a"
        }
+       vpc                  = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_internet_gateway.this[0] will be created
+   resource "aws_internet_gateway" "this" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube"
        }
+       tags_all = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube"
        }
+       vpc_id   = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_nat_gateway.this[0] will be created
+   resource "aws_nat_gateway" "this" {
+       allocation_id                      = (known after apply)
+       association_id                     = (known after apply)
+       connectivity_type                  = "public"
+       id                                 = (known after apply)
+       network_interface_id               = (known after apply)
+       private_ip                         = (known after apply)
+       public_ip                          = (known after apply)
+       secondary_private_ip_address_count = (known after apply)
+       secondary_private_ip_addresses     = (known after apply)
+       subnet_id                          = (known after apply)
+       tags                               = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-us-east-1a"
        }
+       tags_all                           = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-us-east-1a"
        }
    }

  # module.crom_vpc.module.vpc.aws_route.private_nat_gateway[0] will be created
+   resource "aws_route" "private_nat_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       nat_gateway_id         = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
+   resource "aws_route" "public_internet_gateway" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)

+       timeouts {
+           create = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_route_table.private[0] will be created
+   resource "aws_route_table" "private" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-private"
        }
+       tags_all         = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-private"
        }
+       vpc_id           = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table.public[0] will be created
+   resource "aws_route_table" "public" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-public"
        }
+       tags_all         = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-public"
        }
+       vpc_id           = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[0] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[1] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[2] will be created
+   resource "aws_route_table_association" "private" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[0] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[1] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[2] will be created
+   resource "aws_route_table_association" "public" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[0] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.0.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "Private Subnet One"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "Private Subnet One"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[1] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "Private Subnet Two"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "Private Subnet Two"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[2] will be created
+   resource "aws_subnet" "private" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-private-us-east-1c"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-private-us-east-1c"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[0] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.4.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-public-us-east-1a"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-public-us-east-1a"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[1] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.5.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-public-us-east-1b"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-public-us-east-1b"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[2] will be created
+   resource "aws_subnet" "public" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-east-1c"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.6.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-public-us-east-1c"
        }
+       tags_all                                       = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube-public-us-east-1c"
        }
+       vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_vpc.this[0] will be created
+   resource "aws_vpc" "this" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_dns_hostnames                 = true
+       enable_dns_support                   = true
+       enable_network_address_usage_metrics = (known after apply)
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube"
        }
+       tags_all                             = {
+           "Example"    = "webapp-kube"
+           "GithubOrg"  = "pseudonative"
+           "GithubRepo" = "web_app_kube"
+           "Name"       = "webapp-kube"
        }
    }

  # module.crom_eks.module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
+       id                        = (known after apply)
+       json                      = (known after apply)
+       override_policy_documents = []
+       source_policy_documents   = []

+       statement {
+           actions   = [
+               "kms:CancelKeyDeletion",
+               "kms:Create*",
+               "kms:Delete*",
+               "kms:Describe*",
+               "kms:Disable*",
+               "kms:Enable*",
+               "kms:Get*",
+               "kms:ImportKeyMaterial",
+               "kms:List*",
+               "kms:Put*",
+               "kms:ReplicateKey",
+               "kms:Revoke*",
+               "kms:ScheduleKeyDeletion",
+               "kms:TagResource",
+               "kms:UntagResource",
+               "kms:Update*",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "KeyAdministration"

+           principals {
+               identifiers = [
+                   "arn:aws:iam::520291287938:role/ProdFullAccess",
                ]
+               type        = "AWS"
            }
        }
+       statement {
+           actions   = [
+               "kms:Decrypt",
+               "kms:DescribeKey",
+               "kms:Encrypt",
+               "kms:GenerateDataKey*",
+               "kms:ReEncrypt*",
            ]
+           resources = [
+               "*",
            ]
+           sid       = "KeyUsage"

+           principals {
+               identifiers = [
+                   (known after apply),
                ]
+               type        = "AWS"
            }
        }
    }

  # module.crom_eks.module.eks.module.kms.aws_kms_alias.this["cluster"] will be created
+   resource "aws_kms_alias" "this" {
+       arn            = (known after apply)
+       id             = (known after apply)
+       name           = "alias/eks/webapp-kube"
+       name_prefix    = (known after apply)
+       target_key_arn = (known after apply)
+       target_key_id  = (known after apply)
    }

  # module.crom_eks.module.eks.module.kms.aws_kms_key.this[0] will be created
+   resource "aws_kms_key" "this" {
+       arn                                = (known after apply)
+       bypass_policy_lockout_safety_check = false
+       customer_master_key_spec           = "SYMMETRIC_DEFAULT"
+       description                        = "webapp-kube cluster encryption key"
+       enable_key_rotation                = true
+       id                                 = (known after apply)
+       is_enabled                         = true
+       key_id                             = (known after apply)
+       key_usage                          = "ENCRYPT_DECRYPT"
+       multi_region                       = false
+       policy                             = (known after apply)
+       tags                               = {
+           "Environment" = "Production"
+           "Project"     = "web-app-kube"
        }
+       tags_all                           = {
+           "Environment" = "Production"
+           "Project"     = "web-app-kube"
        }
    }

Plan: 62 to add, 0 to change, 0 to destroy. 
```

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.crom_eks.aws_iam_role.eks_cluster_role will be created
  + resource "aws_iam_role" "eks_cluster_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-cluster-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.crom_eks.aws_iam_role.eks_node_group_role will be created
  + resource "aws_iam_role" "eks_node_group_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-node-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.crom_eks.aws_iam_role_policy_attachment.eks_cluster_AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "eks-cluster-role"
    }

  # module.crom_eks.aws_iam_role_policy_attachment.eks_cluster_AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster_AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "eks-cluster-role"
    }

  # module.crom_eks.aws_iam_role_policy_attachment.eks_node_group_AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "eks_node_group_AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "eks-node-group-role"
    }

  # module.crom_eks.aws_iam_role_policy_attachment.eks_node_group_AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks_node_group_AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "eks-node-group-role"
    }

  # module.crom_eks.aws_iam_role_policy_attachment.eks_node_group_AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_node_group_AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "eks-node-group-role"
    }

  # module.crom_eks.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.crom_eks.module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/webapp-kube/cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "Production"
          + "Name"        = "/aws/eks/webapp-kube/cluster"
          + "Project"     = "web-app-kube"
        }
      + tags_all          = {
          + "Environment" = "Production"
          + "Name"        = "/aws/eks/webapp-kube/cluster"
          + "Project"     = "web-app-kube"
        }
    }

  # module.crom_eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Environment"
      + resource_id = (known after apply)
      + value       = "Production"
    }

  # module.crom_eks.module.eks.aws_ec2_tag.cluster_primary_security_group["Project"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Project"
      + resource_id = (known after apply)
      + value       = "web-app-kube"
    }

  # module.crom_eks.module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "webapp-kube"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Environment" = "Production"
          + "Project"     = "web-app-kube"
        }
      + tags_all                  = {
          + "Environment" = "Production"
          + "Project"     = "web-app-kube"
        }
      + version                   = "1.28"

      + encryption_config {
          + resources = [
              + "secrets",
            ]

          + provider {
              + key_arn = (known after apply)
            }
        }

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)
        }

      + timeouts {}

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "0.0.0.0/0",
            ]
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.crom_eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Environment" = "Production"
          + "Name"        = "webapp-kube-eks-irsa"
          + "Project"     = "web-app-kube"
        }
      + tags_all        = {
          + "Environment" = "Production"
          + "Name"        = "webapp-kube-eks-irsa"
          + "Project"     = "web-app-kube"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.crom_eks.module.eks.aws_iam_policy.cluster_encryption[0] will be created
  + resource "aws_iam_policy" "cluster_encryption" {
      + arn         = (known after apply)
      + description = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "webapp-kube-cluster-ClusterEncryption"
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags        = {
          + "Environment" = "Production"
          + "Project"     = "web-app-kube"
        }
      + tags_all    = {
          + "Environment" = "Production"
          + "Project"     = "web-app-kube"
        }
    }

  # module.crom_eks.module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "webapp-kube-cluster-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "Production"
          + "Project"     = "web-app-kube"
        }
      + tags_all              = {
          + "Environment" = "Production"
          + "Project"     = "web-app-kube"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = "webapp-kube-cluster"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "logs:CreateLogGroup",
                            ]
                          + Effect   = "Deny"
                          + Resource = "*"
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }

  # module.crom_eks.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0] will be created
  + resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.crom_eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.crom_eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.crom_eks.module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "webapp-kube-cluster-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "Production"
          + "Name"        = "webapp-kube-cluster"
          + "Project"     = "web-app-kube"
        }
      + tags_all               = {
          + "Environment" = "Production"
          + "Name"        = "webapp-kube-cluster"
          + "Project"     = "web-app-kube"
        }
      + vpc_id                 = (known after apply)
    }

  # module.crom_eks.module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "webapp-kube-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment"                       = "Production"
          + "Name"                              = "webapp-kube-node"
          + "Project"                           = "web-app-kube"
          + "kubernetes.io/cluster/webapp-kube" = "owned"
        }
      + tags_all               = {
          + "Environment"                       = "Production"
          + "Name"                              = "webapp-kube-node"
          + "Project"                           = "web-app-kube"
          + "kubernetes.io/cluster/webapp-kube" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.crom_eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["egress_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow all egress"
      + from_port                = 0
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 4443/tcp webhook"
      + from_port                = 4443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4443
      + type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 6443/tcp webhook"
      + from_port                = 6443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 6443
      + type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 8443/tcp webhook"
      + from_port                = 8443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8443
      + type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node 9443/tcp webhook"
      + from_port                = 9443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 9443
      + type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node ingress on ephemeral ports"
      + from_port                = 1025
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.crom_eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.crom_eks.module.eks.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "cluster_certificate_authority_data" = (known after apply)
          + "cluster_endpoint"                   = (known after apply)
          + "cluster_name"                       = "webapp-kube"
          + "cluster_version"                    = "1.28"
        }
    }

  # module.crom_eks.module.node_group_private.aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "webapp-kube"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3a.medium",
        ]
      + labels                 = {
          + "AccessSpecifier" = "private"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "private-"
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name" = "private"
        }
      + tags_all               = {
          + "Name" = "private"
        }
      + version                = "1.28"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.crom_eks.module.node_group_private.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "private-eks-node-group-"
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.crom_eks.module.node_group_private.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.crom_eks.module.node_group_private.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.crom_eks.module.node_group_private.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.crom_eks.module.node_group_private.aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "private-eks-node-group-"
      + tags_all               = (known after apply)
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name" = "private"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name" = "private"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name" = "private"
            }
        }
    }

  # module.crom_vpc.module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-default"
        }
      + tags_all               = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-default"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + egress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
        }
      + ingress {
          + action     = "allow"
          + cidr_block = "0.0.0.0/0"
          + from_port  = 0
          + protocol   = "-1"
          + rule_no    = 100
          + to_port    = 0
        }
    }

  # module.crom_vpc.module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-default"
        }
      + tags_all               = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-default"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-default"
        }
      + tags_all               = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-default"
        }
      + vpc_id                 = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-us-east-1a"
        }
      + tags_all             = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-us-east-1a"
        }
      + vpc                  = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube"
        }
      + tags_all = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube"
        }
      + vpc_id   = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-us-east-1a"
        }
      + tags_all                           = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-us-east-1a"
        }
    }

  # module.crom_vpc.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.crom_vpc.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-private"
        }
      + tags_all         = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-private"
        }
      + vpc_id           = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-public"
        }
      + tags_all         = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "Private Subnet One"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "Private Subnet One"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "Private Subnet Two"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "Private Subnet Two"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-private-us-east-1c"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-private-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-public-us-east-1a"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-public-us-east-1a"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.5.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-public-us-east-1b"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-public-us-east-1b"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.6.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-public-us-east-1c"
        }
      + tags_all                                       = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube-public-us-east-1c"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.crom_vpc.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube"
        }
      + tags_all                             = {
          + "Example"    = "webapp-kube"
          + "GithubOrg"  = "pseudonative"
          + "GithubRepo" = "web_app_kube"
          + "Name"       = "webapp-kube"
        }
    }

  # module.crom_eks.module.eks.module.kms.data.aws_iam_policy_document.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "this" {
      + id                        = (known after apply)
      + json                      = (known after apply)
      + override_policy_documents = []
      + source_policy_documents   = []

      + statement {
          + actions   = [
              + "kms:CancelKeyDeletion",
              + "kms:Create*",
              + "kms:Delete*",
              + "kms:Describe*",
              + "kms:Disable*",
              + "kms:Enable*",
              + "kms:Get*",
              + "kms:ImportKeyMaterial",
              + "kms:List*",
              + "kms:Put*",
              + "kms:ReplicateKey",
              + "kms:Revoke*",
              + "kms:ScheduleKeyDeletion",
              + "kms:TagResource",
              + "kms:UntagResource",
              + "kms:Update*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyAdministration"

          + principals {
              + identifiers = [
                  + "arn:aws:iam::520291287938:role/ProdFullAccess",
                ]
              + type        = "AWS"
            }
        }
      + statement {
          + actions   = [
              + "kms:Decrypt",
              + "kms:DescribeKey",
              + "kms:Encrypt",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "*",
            ]
          + sid       = "KeyUsage"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # module.crom_eks.module.eks.module.kms.aws_kms_alias.this["cluster"] will be created
  + resource "aws_kms_alias" "this" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/eks/webapp-kube"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.crom_eks.module.eks.module.kms.aws_kms_key.this[0] will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "webapp-kube cluster encryption key"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = false
      + policy                             = (known after apply)
      + tags                               = {
          + "Environment" = "Production"
          + "Project"     = "web-app-kube"
        }
      + tags_all                           = {
          + "Environment" = "Production"
          + "Project"     = "web-app-kube"
        }
    }

Plan: 62 to add, 0 to change, 0 to destroy.
 
```